console.log('M 7-8: 7');

// 7.
// Dragend Drop
// Реалізувати драгн-дроп елемента на нові координати в межах пейджі
// Шар абсолютно спозиціонований відносно body.
// Для завдання нового положення інлайново в top/left записуємо нові координати
// з об'єкта події миші - e.pageY / e.pageX (координати вказівника на сторінці)
/**
 * 1 - створити змінну для контролю чи дозволено перезапис координат (let isDrag = false)
 * 2 - при події "mousedown" (кнопка миші натиснута і утримується на цільовому елементі)
 *     задаємо isDrag = true
 * 3 - Рухаємо мишею(mousemove)/
 *     При цьому якщо перетягування дозволено(isDrag = true)оновлюємо значення 
 *     для інлайново прописаних top/left - ball.style.top = (e.pageY - 20) + 'px'; ...
 *     !!! Рухаємо не по шару а по документу
 * 4 - в новому положенні відпускаємо кнопку, подія "mouseup". (isDrag = false)
 *     !!! Подумайте на якому об'єкті має спрацювати ця подія(шар чи document?)
 */
