console.log('M 3-4: 7');

// 7. 
// Написати скрипт керування особистим кабінетом інтернет банка
// Є об'ект account в якому треба реалізувати
// методи для работы з балансом і історією транзакцій

// Типів транзакцій лише два.
// Можна положить або зняти гроші на/з рахунку
const Transaction = {
    DEPOSIT: "deposit",
    WITHDRAW: "withdraw",
  };
  
  // Кожна транзакція то є об'єкт з властивостями: 
  // id, type, amount, transactionStatus
  
const account = {
    // поточний баланс
    _balance: 0,

    // Поточний id транзакції
    _curID: 0,

    // Історія транзакцій
    _transactions: [],

    // Метод створює і повертає об'єкт транзакції
    // Приймає суму, тип і статус транзакциї
    createTransaction(type, amount, transactionStatus) {
      // code here
    },

    // Метод для додавання суми на баланс.
    // Приймає суму транцакції.
    // Викликає createTransaction для створення об'єкта транзакції
    // опісля додає його до історії транзакцій
    deposit(amount) {
      // code here
    },

    // Метод для зняття суми з балансу.
    // Приймає суму транцакції.
    // Викликає createTransaction для створення об'єкта транзакції
    // опісля додає його до історії транзакцій
    // Якщо amount більше за потчний баланс, виводим сповіщення про,
    // недостатню кількість коштів на рахунку
    withdraw(amount) {
      // code here
    },

    // Метод повертає текущий баланс
    getBalance() {
      // code here
    },

    // Метод шукає і повертає об'єкт транзакції за id
    getTransactionDetails(id) {
      // code here
    },

    // Метод повертає кількість коштів визначеного типу
    // транзакції з всієї історії транзакцій
    getTransactionType(type) {
      // code here
    },
};