console.log('M 7-8: 5');

// 5.
// Напишіть програму, яка змінює колір жирним словам 
// з наступного абзацу, при наведенні мишкою на посилання в рамці зверху

// посилання
/**
 * [On mouse over here bold words of the following paragraph will be highlighted]
 */

/**
 * 1 - при наведенні миші на посилання (mouseover)
 *     колір всіх болдових слів змінюється(можна рандомно)
 * 2 - при залишенні миші посилання  (mouseleave)
 *     колір всіх болдових слів стає як був. 
 *     Також реалізувати видалення прослуховувача (mouseleave)
 *     коли вказівник покидає посилання.
 * 3 - коли вказівник рухається по посиланню не виходячи з неї (mousemove)
 *     реалізувати рандомну зміну кольру кожні 400мс(debounce, throttle)
 */
