console.log('M 8-9: 2');

/**
 * ЗАВДАННЯ 2
 * - Використовуй prompt і повертай значення звідти.
 * Створи функцію, яка прийматиме значення з prompt і всередині якої буде проміс.
 * Якщо значення не є числом, відхиляй проміс і логіруй "error".
 * Якщо значення парне, вирішуй проміс і повертай "even" через 1 секунду.
 * Якщо значення не парне, вирішуй проміс і повертай "odd" через 2 секунди.
 */

const num = 'a2' || prompt('Type anything.', 'dsd');

function checkData(val) {
    // code
}

checkData(num)