console.log('M 1-2: 2');

// 2.
// Напишіть програму, яка отримає від користувача
// число (кількість хвилин) і виведе у консоль
// Рядок у форматі годин і хвилин 01:10
// https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/String/padStart
// 70 === 01:10

// Отримайте кількість хвилин - 

// Візіміть ціле від ділення на 60, це кількість годин

// Обробіть години так щоб відповідали формату

// Візіміть залишок від ділення на 60, це кількість хвилин

// Обробіть хвилини так щоб відповідали формату

// Вивести результат