console.log('M 1-2: 5');

// 5. 
// Напишіть код, який запитуватиме
// Логін за допомогою prompt і логувати результат
// В консоль браузера

// Якщо відвідувач вводить "admin",
// то наступний prompt запитує пароль,
// інакше (нічого не ввели або натиснута клавіша Esc)
// вивести рядок "Я вас не знаю".

// Якщо на запит паролю нічого не ввели або
// натиснута клавіша Esc
// Вивести рядок "Скасовано"

// Пароль перевіряти так:
// Якщо введено пароль "password",
// то вивести рядок "Здрастуйте!"
// інакше виводити рядок "Невірний пароль!"

const loginInput = prompt('Введіть свій логін', 'admin');

