console.log('M 1-2: 6');

// 6.
// При завантаженні сторінки користувачеві пропонується
// в prompt ввести число.
// Значення додається до значення змінної total.

// Операція введення числа триває до того часу,
// Поки користувач не натисне кнопку Cancel в prompt або Esc.

// Після того як користувач припинив введення, натиснувши на
// кнопку Cancel, показати alert з рядком
// "Загальна сума введених чисел дорівнює [число]."
// Робити перевірку, що користувач ввів саме число,
// а чи не довільний набір символів, не потрібно.
